Cases/Airfin/system/HotStream/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

#include "$FOAM_CASE/Geometry.txt"

// Inlet curve arc locations
Ixloc0		#eval{ $L_ch_min-(($W_ch+$W_so)*sin($radHalfAngle)) };
Iyloc0		#eval{ $W_cr_max-(($W_ch+$W_so)*sin($radHalfAngle)) };
Ixloc1		#eval{ $L_ch_min-($W_so*sin($radHalfAngle)) };
Iyloc1		#eval{ $W_cr_max-($W_so*sin($radHalfAngle)) };
// Outlet curve arc locations
Oxloc0		#eval{ $L_ch_max+(($W_ch+$W_so)*sin($radHalfAngle)) };
Oyloc0		#eval{ $W_cr_min+(($W_ch+$W_so)*sin($radHalfAngle)) };
Oxloc1		#eval{ $L_ch_max+($W_so*sin($radHalfAngle)) };
Oyloc1		#eval{ $W_cr_min+($W_so*sin($radHalfAngle)) };

vertices
(
	// Central channel
    ($L_ch_min $W_ch_min $D_ch_min) // 0
    ($L_ch_max $W_ch_min $D_ch_min) // 1
    ($L_ch_max $W_ch_max $D_ch_min) // 2
    ($L_ch_min $W_ch_max $D_ch_min) // 3
    ($L_ch_min $W_ch_min $D_ch_max) // 4
    ($L_ch_max $W_ch_min $D_ch_max) // 5
    ($L_ch_max $W_ch_max $D_ch_max) // 6
    ($L_ch_min $W_ch_max $D_ch_max) // 7

	// Outlet curve
    ($L_cr_min $W_cr_max $D_ch_min) // 8
    ($X_cr_min $W_cr_max $D_ch_min) // 9
    ($L_cr_min $W_cr_max $D_ch_max) // 10
    ($X_cr_min $W_cr_max $D_ch_max) // 11

	// Inlet curve
    ($L_cr_max $W_cr_min $D_ch_min) // 12
    ($X_cr_max $W_cr_min $D_ch_min) // 13
    ($L_cr_max $W_cr_min $D_ch_max) // 14
    ($X_cr_max $W_cr_min $D_ch_max) // 15

	// Inlet
    ($L_cr_max $I_ch_min $D_ch_min) // 16
    ($X_cr_max $I_ch_min $D_ch_min) // 17
    ($L_cr_max $I_ch_min $D_ch_max) // 18
    ($X_cr_max $I_ch_min $D_ch_max) // 19    

	// Outlet
    ($L_cr_min $O_ch_max $D_ch_min) // 20
    ($X_cr_min $O_ch_max $D_ch_min) // 21
    ($L_cr_min $O_ch_max $D_ch_max) // 22
    ($X_cr_min $O_ch_max $D_ch_max) // 23    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) porousBedHot ($x_cells_h $y_cells_h 1) simpleGrading (1 1 1) // Central blocks
    hex (8 0 3 9 10 4 7 11) porousBedHotOutletCurve ($y_cells_c $y_cells_h 1) simpleGrading (1 1 1) // Outlet curve
    hex (1 13 12 2 5 15 14 6) porousBedHotInletCurve ($y_cells_c $y_cells_h 1) simpleGrading (1 1 1) // Inlet curve
    hex (17 16 12 13 19 18 14 15) porousBedHotInlet ($y_cells_h 20 1) simpleGrading (1 1 1) // Inlet
    hex (8 9 21 20 10 11 23 22) porousBedHotOutlet ($y_cells_h 20 1) simpleGrading (1 1 1) // Outlet
);

edges
(
	arc 8 0  ($Ixloc0 $Iyloc0 $D_ch_min)
	arc 10 4 ($Ixloc0 $Iyloc0 $D_ch_max)
	arc 9 3  ($Ixloc1 $Iyloc1 $D_ch_min)
	arc 11 7 ($Ixloc1 $Iyloc1 $D_ch_max)

	arc 12 2 ($Oxloc0 $Oyloc0 $D_ch_min)
	arc 6 14 ($Oxloc0 $Oyloc0 $D_ch_max)
	arc 13 1 ($Oxloc1 $Oyloc1 $D_ch_min)
	arc 15 5 ($Oxloc1 $Oyloc1 $D_ch_max)
);

boundary
(
    wallTopAirHot
    {
        type wall;
        faces
        (
            (9 3 7 11)
            (3 2 6 7)
            (2 12 14 6)
            (16 18 14 12)
            (9 11 21 23)
        );
    }
    wallBottomAirHot
    {
        type wall;
        faces
        (
            (8 0 4 10)
            (0 1 5 4)
            (1 13 15 5)
            (19 17 13 15)
            (10 8 20 22)
        );
    }
    outletAirHot
    {
        type patch;
        faces
        (
            (20 21 22 23)
        );
    }
    inletAirHot
    {
        type patch;
        faces
        (
            (17 16 18 19)
        );
    }
    frontAndBackHot //2D
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
            (8 0 3 9)
            (10 4 7 11)
            (1 13 12 2)
            (5 15 14 6)
            (17 16 12 13)
            (19 18 14 15)
            (8 9 21 20)
            (10 11 23 22)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
