Cases/Airfin/system/Solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

#include "$FOAM_CASE/Geometry.txt"

vertices
(
	// Solid domain
    ($L_bk_min $W_bk_min $D_ch_min)
    ($L_bk_max $W_bk_min $D_ch_min)
    ($L_bk_max $W_bk_max $D_ch_min)
    ($L_bk_min $W_bk_max $D_ch_min)
    ($L_bk_min $W_bk_min $D_ch_max)
    ($L_bk_max $W_bk_min $D_ch_max)
    ($L_bk_max $W_bk_max $D_ch_max)
    ($L_bk_min $W_bk_max $D_ch_max)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($x_cells_s $y_cells_s 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    wallLeftSolid
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    wallRightSolid
    {
        type patch;
        faces
        (
            (2 6 5 1)   
        );
    }
    wallTopSolid
    {
        type wall;
        faces
        (
            (3 7 6 2)   
        );
    }
    wallBottomSolid
    {
        type wall;
        faces
        (
            (1 5 4 0)   
        );
    } 
    frontAndBackSolid //2D
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
