Cases/Airfin/constant/HotStream/porousZones
// Friction Factor on 5 HotStream Cell Zones 

#include "$FOAM_CASE/Geometry.txt"

CentralChannelHot
{
    type           explicitPorositySource;
    active         true;
    explicitPorositySourceCoeffs
    {
        type           DarcyForchheimer;
        selectionMode  cellZone;
        cellZone       porousBedHot;
        DarcyForchheimerCoeffs
        {
            d          [0 -2 0 0 0 0 0] (0 0 0);
            f          [0 -1 0 0 0 0 0] ($f_par_h $f_per_h 0);
            coordinateSystem
            {
                x          (1 0 0);
                y          (0 1 0);
                #includeEtc "caseDicts/general/coordinateSystem/cartesianXY"
            }
        }
    }
}

InletCurveHot
{
    type           explicitPorositySource;
    active         true;
    explicitPorositySourceCoeffs
    {
        type           DarcyForchheimer;
        selectionMode  cellZone;
        cellZone       porousBedHotInletCurve;
        DarcyForchheimerCoeffs
        {
            d          [0 -2 0 0 0 0 0] (0 0 0);
            f          [0 -1 0 0 0 0 0] ($f_per_h $f_par_h 0);
            coordinateSystem
            {
                origin     ($L_ch_max $W_cr_min 0);
                axis       (0 0 1);
                #includeEtc "caseDicts/general/coordinateSystem/cylindrical"
            }
        }
    }
}

InletHot
{
    type           explicitPorositySource;
    active         true;
    explicitPorositySourceCoeffs
    {
        type           DarcyForchheimer;
        selectionMode  cellZone;
        cellZone       porousBedHotInlet;
        DarcyForchheimerCoeffs
        {
            d          [0 -2 0 0 0 0 0] (0 0 0);
            f          [0 -1 0 0 0 0 0] ($f_par_h $f_per_h 0);
            coordinateSystem
            {
                x          (0 1 0);
                y          (1 0 0);
                #includeEtc "caseDicts/general/coordinateSystem/cartesianXY"
            }
        }
    }
}

OutletHot
{
    type           explicitPorositySource;
    active         true;
    explicitPorositySourceCoeffs
    {
        type           DarcyForchheimer;
        selectionMode  cellZone;
        cellZone       porousBedHotOutlet;
        DarcyForchheimerCoeffs
        {
            d          [0 -2 0 0 0 0 0] (0 0 0);
            f          [0 -1 0 0 0 0 0] ($f_par_h $f_per_h 0);
            coordinateSystem
            {
                x          (0 1 0);
                y          (1 0 0);
                #includeEtc "caseDicts/general/coordinateSystem/cartesianXY"
            }
        }
    }
}

OutletCurveHot
{
    type           explicitPorositySource;
    active         true;
    explicitPorositySourceCoeffs
    {
        type           DarcyForchheimer;
        selectionMode  cellZone;
        cellZone       porousBedHotOutletCurve;
        DarcyForchheimerCoeffs
        {
            d          [0 -2 0 0 0 0 0] (0 0 0);
            f          [0 -1 0 0 0 0 0] ($f_per_h $f_par_h 0);
            coordinateSystem
            {
                origin     ($L_ch_min $W_cr_max 0);
                axis       (0 0 1);
                #includeEtc "caseDicts/general/coordinateSystem/cylindrical"
            }
        }
    }
}

// ************************************************************************* //
