Cases/Airfin/constant/Solid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{	// Coefficients for Steel 316
    specie
    {
        nMoles      1;
        molWeight   55.845;
    }

    transport
    {
        kappa       17.6;
    }

    thermodynamics
    {
        Hf          0;
        Cp          533;
    }

    equationOfState
    {
        rho         8030;
    }
}

// ************************************************************************* //
