Cases/Airfin/0.orig/HotStream/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/Variables.txt"

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform $Tref;

boundaryField
{
	"inlet.*"
	{
    	type            fixedValue;
    	value           uniform $ThInlet;
	}
	"(outlet.*|wall.*)"
	{
    	type            zeroGradient;
	}
}

// ************************************************************************* //
