Cases/Airfin/system/Solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-07;
        relTol           0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 	0;
    residualControl
    {
        h               	1e-5;
    }
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        h               0.7;
    }
}

// ************************************************************************* //
